brew "bat" # Better 'cat'
brew "fd" # Better 'find'
brew "fnm" # Better node version manager
brew "fzf" # Fuzzy finder
brew "hyperfine" # Performance testing
brew "lazygit" # Git TUI
brew "lazydocker" # Docker TUI
brew "opencode" # Open-source, bring your own model Claude Code equivalent
brew "ripgrep" # Better 'grep'
brew "tree"
brew "uv"
brew "zellij" # Better 'tmux'
brew "zoxide" # Better 'cd'

cask "1password"
cask "cursor"
cask "docker-desktop"
cask "google-chrome"
# cask "alacritty"
cask "ghostty" # Terminal
# cask "warp"
cask "rectangle"
cask "slack"
